open-flights/app/controllers/api/v1/airlines_controller.rb

            def show
                airline = Airline.find_by(slug: params[:slug])
---
SELECT "airlines".* FROM "airlines" WHERE "airlines"."slug" = $1 LIMIT $2  [["slug", "airline-do-pai-vam-bora"], ["LIMIT", 1]]

            def create
                airline = Airline.new(airline_params)

                if airline.save
---
INSERT INTO "airlines" ("name", "image_url", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "airline do pai vam bora"], ["image_url", nil], ["slug", "airline-do-pai-vam-bora"], ["created_at", "2024-07-01 18:37:02.146978"], ["updated_at", "2024-07-01 18:37:02.146978"]]

            def update
                airline = Airline.find_by(slug: params[:slug])

                if airline.update(airline_params)
---
SELECT "airlines".* FROM "airlines" WHERE "airlines"."slug" = $1 LIMIT $2  [["slug", "airline-do-pai-vam-bora"], ["LIMIT", 1]]
UPDATE "airlines" SET "name" = $1, "updated_at" = $2 WHERE "airlines"."id" = $3  [["name", "airline séria"], ["updated_at", "2024-07-01 18:39:04.150102"], ["id", 9]]

            def destroy
                airline = Airline.find_by(slug: params[:slug])

                if airline.destroy
---
SELECT "airlines".* FROM "airlines" WHERE "airlines"."slug" = $1 LIMIT $2  [["slug", "airline-do-pai-vam-bora"], ["LIMIT", 1]]
DELETE FROM "airlines" WHERE "airlines"."id" = $1  [["id", 9]]